RoBorregos/home-custom-base/firmware/STM32H7_OMNIBASE_CAN_BNO085/CM7/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

#define PD7_Pin GPIO_PIN_7
#define PD6_Pin GPIO_PIN_6
#define PD5_Pin GPIO_PIN_5
#define PD4_Pin GPIO_PIN_4

#define PE2_Pin GPIO_PIN_2
#define PE3_Pin GPIO_PIN_3
#define PE4_Pin GPIO_PIN_4
#define PE6_Pin GPIO_PIN_6

#define BT_UART_TOGGLE_BUTTON  0x02
#define BT_ESTOP_BUTTON 0x04

/* Hardware emergency-stop input. NORMALLY-CLOSED push button wired between
 * PE2 and GND with the STM32 internal pull-up enabled. Resting state (NC
 * contact closed to GND) reads LOW; pressed (NC opens, internal pull-up
 * wins) reads HIGH. A broken wire also reads HIGH, so the e-stop is
 * fail-safe against open-circuit faults in the harness. */
#define ESTOP_PIN          GPIO_PIN_2
#define ESTOP_PORT         GPIOE
#define ESTOP_EXTI_IRQn    EXTI2_IRQn

/* ESTOP status LED — on while SM_ESTOP is active.
 * PE0, push-pull output, no pull, active HIGH. */
#define ESTOP_LED_PIN      GPIO_PIN_0
#define ESTOP_LED_PORT     GPIOE

typedef struct {
    float Kp;
    float Ki;
    float Kd;
} PIDGains;

typedef struct {
    PIDGains x_pid;
    PIDGains y_pid;
    PIDGains phi_pid;
    PIDGains u_pid[4];  // Per-wheel PID
} PIDConfig;

typedef struct
{
	double x_desired;
	double y_desired;
	double phi_end;
	double d;
	double x_off;
	double y_off;
	double r;
//	uint8_t state;
	float u1_desired;
	float u2_desired;
	float u3_desired;
	float u4_desired;

} InputData;

typedef struct {
    /* Euler angles (degrees) — kept for backward compatibility with the dashboard. */
    double yaw;
    double roll;
    double pitch;

    /* Orientation quaternion from BNO085 SH2_GAME_ROTATION_VECTOR (6-axis, no mag).
     * Standard convention: (qx, qy, qz, qw) with qw being the real component. */
    float qx;
    float qy;
    float qz;
    float qw;

    /* Angular velocity from SH2_GYROSCOPE_CALIBRATED, units rad/s, body frame. */
    float wx;
    float wy;
    float wz;

    /* Linear acceleration from SH2_LINEAR_ACCELERATION (gravity removed),
     * units m/s^2, body frame. */
    float ax;
    float ay;
    float az;
} IMUData;

typedef struct {
    double err_x;
    double err_y;
    double err_phi;
    double u_errs[4];
} Errors;

typedef struct {
    uint32_t current;
    uint32_t previous;
    uint32_t delta;
    uint32_t print_prev;
} TimeState;

typedef struct {
	uint16_t cnt_vals[4];
	uint16_t prevcnt_vals[4];
	float angleVals[4];
	double omegaVals[4];
} EncoderData;

typedef struct {
	/* Legacy fields (kept so existing slim/fat printf paths stay valid). */
	double x_pos;
	double y_pos;
	double phi;
	double q_dot[3]; // <- Inertial x_dot, y_dot, z_dot

	/* EKF-shaped output (ROS nav_msgs/Odometry friendly).
	 * z_pos and roll/pitch are not estimated — they are kept here for
	 * struct-shape compatibility with downstream ROS messages only. */
	double z_pos;
	float  qx, qy, qz, qw;          /* orientation from EKF yaw (flat ground) */
	double vx_body, vy_body, vz_body;
	float  wx, wy, wz;              /* wz = EKF omega; wx/wy not estimated */

	/* Full 6x6 covariance matrices (row-major, ROS layout).
	 * Pose order : [ x,  y,  z,  roll, pitch, yaw ]
	 * Twist order: [ vx, vy, vz, wx,   wy,    wz ]
	 * Unestimated states carry a large variance on the diagonal so any
	 * downstream filter treats them as effectively "unknown". */
	double pose_covariance[36];
	double twist_covariance[36];
} OdomData;

typedef struct {
  double x_dot;   // desired x velocity
  double y_dot;   // desired y velocity
  double phi_dot;   // desired rotational velocity
  double PWM_vals[4]; // Motor PIDs outputs
  uint16_t dutyCycles[4]; // Motor control limited duty cycles
  uint8_t M_dirs[4]; // Motor directions,  0 = forward, 1 = back <- arbitrary
  double u[4]; // ik computed required wheel speeds (wheel velocity control input)
} CtrlOutData;


typedef struct {
    IMUData imu;
    EncoderData encoders;
    Errors error;
    TimeState time;
    OdomData odom;
    CtrlOutData ctrl;
} CtrlTsk_Data;

typedef enum {
    /* Runtime control commands */
    ODRIVE_CMD_NONE                = 0x00,
    ODRIVE_CMD_SET_VEL             = 0x01,
    ODRIVE_CMD_SET_STATE           = 0x02,
    ODRIVE_CMD_CLEAR_ERRORS        = 0x03,
    ODRIVE_CMD_SET_CONTROLLER_MODE = 0x04,
    ODRIVE_CMD_SET_LIMITS          = 0x05,
    ODRIVE_CMD_SET_POS             = 0x06,
    ODRIVE_CMD_STOP_ODRIVES        = 0x07,
    /* Configuration / state-machine sub-commands */
    ODRIVE_CFG_CLEAR_ERRORS        = 0x20,
    ODRIVE_CFG_SET_STATE           = 0x21,
    ODRIVE_CFG_SET_CTRL_MODE       = 0x22,
    ODRIVE_CFG_SET_LIMITS          = 0x23,
    ODRIVE_CFG_SET_POS_GAIN        = 0x24,
    ODRIVE_CFG_SET_VEL_GAINS       = 0x25,
    ODRIVE_CFG_STARTUP             = 0x26,
    ODRIVE_CFG_REBOOT              = 0x27,
    ODRIVE_CFG_SET_TORQUE          = 0x28,
    ODRIVE_CFG_STOP                = 0x29,
    ODRIVE_CFG_SET_INPUT_POS       = 0x30,
} ODriveCmdType;

typedef enum {
    SM_BOOT    = 0,
    SM_STARTUP = 1,
    SM_RUNNING = 2,
    SM_IDLE    = 3,
    /* SM_ESTOP: entered on hardware e-stop press (rising edge on ESTOP_PIN).
     * Axes are set IDLE so the base is push-movable. The main loop skips
     * command processing and the SM_RUNNING auto-rearm block while in this
     * state. Exited via button release (falling edge after a debounce
     * dead-band), re-arming back to whatever ctrl_mode was active. */
    SM_ESTOP   = 4,
} ODriveSMState;

typedef enum {
    CMD_SOURCE_ROS = 1,
    CMD_SOURCE_BT  = 2,
} ODriveCmdSource;

typedef struct {
    ODriveCmdType type;
    uint8_t target_mask;     // bitmask or 0xFF for all axes
    double robot_twist[3];    // used for set vel
    double torque_ff[4];      // optional
    uint8_t axis_state;      // used for set state
    uint32_t control_mode;   // if needed
    uint32_t input_mode;     // if needed
    float vel_limit;
    float curr_limit;
    float pos_gain;
    float vel_gain;
    float vel_int_gain;
    float input_pos_target;
    float input_pos_vel_ff;
    float input_pos_trq_ff;
    uint8_t  source;
    uint16_t buttons;
} ODriveCmdMsg;

typedef struct
{
    uint8_t  node_id[4];

    uint32_t axis_error[4];
    uint8_t  axis_state[4];
    uint8_t  controller_status[4];

    float pos_est[4];
    float vel_est[4];

    int32_t encoder_shadow[4];
    int32_t encoder_cpr[4];

    float iq_setpoint[4];
    float iq_measured[4];

    float bus_voltage[4];
    float bus_current[4];

    uint8_t updated[4];

    double IK_computed_wheel_speeds[4];

    IMUData imu;

    OdomData odom;

    uint32_t timestamp_ms;
    float    bt_vx;
    float    bt_vy;
    float    bt_wz;
    uint8_t  bt_active;
    /* Firmware state machine — matches the ODriveSMState enum. Filled by
     * StartODriveTask before each push so the dashboard can distinguish
     * SM_IDLE (commanded) from SM_ESTOP (hardware button held), which both
     * look like axis_state=IDLE on the per-ODrive channels. */
    uint8_t  sm_state;
} ODriveTelemetryMsg;

/* ── Firmware error reporting ──────────────────────────────────────────────
 * FirmwareError is pushed to ERR_QueueHandle by any task; the TX task drains
 * it and emits  E=<code>,<axis>,<detail>\r\n  on UART3.
 * axis: 0-3 for per-ODrive, FERR_NO_AXIS (0xFF) for system-level.
 * detail: HAL_StatusTypeDef, rc code, axis state, or watermark words.
 * ─────────────────────────────────────────────────────────────────────────*/
typedef struct {
    uint8_t code;
    uint8_t axis;
    uint8_t detail;
} FirmwareError;

#define FERR_NO_AXIS              0xFF

/* CAN / bus */
#define FERR_CAN_TX_TIMEOUT       0x01
#define FERR_CAN_BUSOFF           0x02
#define FERR_CAN_RX_FAIL          0x03

/* ODrive startup */
#define FERR_STARTUP_FAILED       0x10

/* Arm / re-arm */
#define FERR_ARM_TIMEOUT          0x20
#define FERR_AXIS_REARM           0x21  /* axis fell out of CLOSED_LOOP, auto-rearm issued */

/* Runtime axis events */
#define FERR_AXIS_FAULT           0x30  /* AXIS_Error register went non-zero */
#define FERR_CMD_WATCHDOG         0x31  /* no SET_VEL within CMD_WATCHDOG_TIMEOUT_MS */
#define FERR_HEARTBEAT_TIMEOUT    0x32  /* axis stopped sending CAN heartbeats */

/* IMU */
#define FERR_IMU_OPEN             0x40
#define FERR_IMU_SET_CALLBACK     0x41
#define FERR_IMU_REPORT_CFG       0x42
#define FERR_IMU_RESET            0x43

/* BT / queue */
#define FERR_BT_QUEUE_FULL        0x50
#define FERR_BT_PARSE_FAIL        0x51

/* System */
#define FERR_STACK_LOW            0x60  /* detail = remaining words (task id encoded in axis) */
#define FERR_STACK_OVERFLOW       0x61  /* vApplicationStackOverflowHook fired */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/

/* USER CODE BEGIN Private defines */
#define STLINK_RX_Pin GPIO_PIN_8
#define STLINK_RX_GPIO_Port GPIOD
#define STLINK_TX_Pin GPIO_PIN_9
#define STLINK_TX_GPIO_Port GPIOD
#define MCP2515_CS_Pin GPIO_PIN_14
#define MCP2515_CS_GPIO_Port GPIOD

#define PI 3.141592

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
